aoa_0/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1.0;

vertices
(
    (-5 -2.5 0)
    (15 -2.5 0)
    (15 2.5 0)
    (-5 2.5 0)
    (-5 -2.5 0.1)
    (15 -2.5 0.1)
    (15 2.5 0.1)
    (-5 2.5 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (256 64 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    front
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    back
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);