aoa_0/system/controlDict
FoamFile 
{
    version     2.0;
    format     ascii;
    class      dictionary;
    object     controlDict;
}

solver incompressibleFluid;

startFrom       startTime;
startTime       0;
stopAt         endTime;
endTime        20;
deltaT         0.001;
writeControl   timeStep;
writeInterval  100;
purgeWrite     0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat       general;
timePrecision 6;
runTimeModifiable true;