aoa_0/system/fvSchemes
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvSchemes;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default  Gauss linear;
}

divSchemes
{
    default none;
    div(phi,U)      Gauss linear upwind;

}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}