aoa_0/system/snappyHexMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object snappyHexMeshDict;
}

castellatedMesh true;
snap true;
addLayers false;

geometry
{
    airfoil
    {
        type triSurfaceMesh;
        file "naca0012.stl";
    }
}

castellatedMeshControls
{
    maxGlobalCells 400000;
    maxLocalCells 100000;
    minRefinementCells 10;
    nCellsBetweenLevels 3;

    features
    (
        //after extracting features
        {
            file "naca0012.eMesh";
            level 4;
        }
    );

    refinementSurfaces
    {
        airfoil
        {
            level (3 4); 
            //minimum and maximum refinement levels
        }
    }

    refinementRegions
    {
        //will add later, for the wake region
    }
    resolveFeatureAngle 30;
    insidePoint (14 2.5 0.05);
    allowFreeStandingZoneFaces true;


}
meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-9;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
}

snapControls
{
    nSmoothPatch    3;
    tolerance       2.0;
    nSolveIter      30;
    nRelaxIter      5;
}



mergeTolerance 1e-6;