aoa_0/system/wallShearStressDict
FoamFile
{
    version  2.0;
    format ascii;
    class dictionary;
    object wallShearStressDict;
}

type wallShearStress;
libs ("libfieldFunctionObjects.so");
patches (airfoil);

writeControl timeStep;
writeInterval 1000;